In [5]:
import pandas as pd
import numpy as np

In [6]:
data = {'id':[21,42,12,86], 'Name':['Bob','Karen','Kate','Bill']}
df_raw = pd.DataFrame(data)
df_raw.head()

   id   Name
0  21    Bob
1  42  Karen
2  12   Kate
3  86   Bill

In [8]:
df = (df_raw
      .set_index('row' + df_raw.index.astype('str'))
)

In [9]:
df

      id   Name
row0  21    Bob
row1  42  Karen
row2  12   Kate
row3  86   Bill